; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-7nodes-1000size-4degree-100mindistance-2trucks-4packages-940seed

(define (problem transport-three-cities-sequential-7nodes-1000size-4degree-100mindistance-2trucks-4packages-940seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-3-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  city-3-loc-7 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 507,112 -> 945,50
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 45)
  ; 945,50 -> 507,112
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 45)
  ; 56,769 -> 97,599
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 18)
  ; 97,599 -> 56,769
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 18)
  ; 723,655 -> 856,703
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 15)
  ; 856,703 -> 723,655
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 15)
  ; 412,395 -> 97,599
  (road city-1-loc-7 city-1-loc-2)
  (= (road-length city-1-loc-7 city-1-loc-2) 38)
  ; 97,599 -> 412,395
  (road city-1-loc-2 city-1-loc-7)
  (= (road-length city-1-loc-2 city-1-loc-7) 38)
  ; 412,395 -> 507,112
  (road city-1-loc-7 city-1-loc-3)
  (= (road-length city-1-loc-7 city-1-loc-3) 30)
  ; 507,112 -> 412,395
  (road city-1-loc-3 city-1-loc-7)
  (= (road-length city-1-loc-3 city-1-loc-7) 30)
  ; 412,395 -> 723,655
  (road city-1-loc-7 city-1-loc-6)
  (= (road-length city-1-loc-7 city-1-loc-6) 41)
  ; 723,655 -> 412,395
  (road city-1-loc-6 city-1-loc-7)
  (= (road-length city-1-loc-6 city-1-loc-7) 41)
  ; 2972,142 -> 2623,257
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 37)
  ; 2623,257 -> 2972,142
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 37)
  ; 2245,477 -> 2623,257
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 44)
  ; 2623,257 -> 2245,477
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 44)
  ; 2371,896 -> 2245,477
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 44)
  ; 2245,477 -> 2371,896
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 44)
  ; 2664,563 -> 2623,257
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 31)
  ; 2623,257 -> 2664,563
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 31)
  ; 2664,563 -> 2245,477
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 43)
  ; 2245,477 -> 2664,563
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 43)
  ; 2664,563 -> 2371,896
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 45)
  ; 2371,896 -> 2664,563
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 45)
  ; 2787,344 -> 2623,257
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 19)
  ; 2623,257 -> 2787,344
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 19)
  ; 2787,344 -> 2972,142
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 28)
  ; 2972,142 -> 2787,344
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 28)
  ; 2787,344 -> 2664,563
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 26)
  ; 2664,563 -> 2787,344
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 26)
  ; 2013,787 -> 2245,477
  (road city-2-loc-7 city-2-loc-3)
  (= (road-length city-2-loc-7 city-2-loc-3) 39)
  ; 2245,477 -> 2013,787
  (road city-2-loc-3 city-2-loc-7)
  (= (road-length city-2-loc-3 city-2-loc-7) 39)
  ; 2013,787 -> 2371,896
  (road city-2-loc-7 city-2-loc-4)
  (= (road-length city-2-loc-7 city-2-loc-4) 38)
  ; 2371,896 -> 2013,787
  (road city-2-loc-4 city-2-loc-7)
  (= (road-length city-2-loc-4 city-2-loc-7) 38)
  ; 1078,2672 -> 1495,2451
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 48)
  ; 1495,2451 -> 1078,2672
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 48)
  ; 1909,2246 -> 1495,2451
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 47)
  ; 1495,2451 -> 1909,2246
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 47)
  ; 1450,2707 -> 1495,2451
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 26)
  ; 1495,2451 -> 1450,2707
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 26)
  ; 1450,2707 -> 1078,2672
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 38)
  ; 1078,2672 -> 1450,2707
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 38)
  ; 1904,2900 -> 1450,2707
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 50)
  ; 1450,2707 -> 1904,2900
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 50)
  ; 1258,2517 -> 1495,2451
  (road city-3-loc-6 city-3-loc-1)
  (= (road-length city-3-loc-6 city-3-loc-1) 25)
  ; 1495,2451 -> 1258,2517
  (road city-3-loc-1 city-3-loc-6)
  (= (road-length city-3-loc-1 city-3-loc-6) 25)
  ; 1258,2517 -> 1078,2672
  (road city-3-loc-6 city-3-loc-2)
  (= (road-length city-3-loc-6 city-3-loc-2) 24)
  ; 1078,2672 -> 1258,2517
  (road city-3-loc-2 city-3-loc-6)
  (= (road-length city-3-loc-2 city-3-loc-6) 24)
  ; 1258,2517 -> 1450,2707
  (road city-3-loc-6 city-3-loc-4)
  (= (road-length city-3-loc-6 city-3-loc-4) 27)
  ; 1450,2707 -> 1258,2517
  (road city-3-loc-4 city-3-loc-6)
  (= (road-length city-3-loc-4 city-3-loc-6) 27)
  ; 1358,2043 -> 1495,2451
  (road city-3-loc-7 city-3-loc-1)
  (= (road-length city-3-loc-7 city-3-loc-1) 43)
  ; 1495,2451 -> 1358,2043
  (road city-3-loc-1 city-3-loc-7)
  (= (road-length city-3-loc-1 city-3-loc-7) 43)
  ; 1358,2043 -> 1258,2517
  (road city-3-loc-7 city-3-loc-6)
  (= (road-length city-3-loc-7 city-3-loc-6) 49)
  ; 1258,2517 -> 1358,2043
  (road city-3-loc-6 city-3-loc-7)
  (= (road-length city-3-loc-6 city-3-loc-7) 49)
  ; 856,703 <-> 2013,787
  (road city-1-loc-4 city-2-loc-7)
  (= (road-length city-1-loc-4 city-2-loc-7) 117)
  (road city-2-loc-7 city-1-loc-4)
  (= (road-length city-2-loc-7 city-1-loc-4) 117)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 170)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 170)
  (road city-2-loc-1 city-3-loc-7)
  (= (road-length city-2-loc-1 city-3-loc-7) 130)
  (road city-3-loc-7 city-2-loc-1)
  (= (road-length city-3-loc-7 city-2-loc-1) 130)
  (at package-1 city-2-loc-3)
  (at package-2 city-1-loc-7)
  (at package-3 city-3-loc-7)
  (at package-4 city-2-loc-4)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-4)
  (at truck-2 city-1-loc-4)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-2)
  (at package-4 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-2-loc-4 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-2-loc-4) (capacity truck-1 capacity-4)
   added: (in package-4 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 4
2. (drive truck-1 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 4
3. (pick-up truck-1 city-2-loc-3 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-2-loc-3) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
4. (drive truck-1 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 4
5. (drive truck-1 city-2-loc-1 city-3-loc-7)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-3-loc-7)
   goals met: 0 of 4
6. (pick-up truck-1 city-3-loc-7 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-3-loc-7) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
7. (drive truck-1 city-3-loc-7 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-7)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 4
8. (drive truck-1 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-3)
   goals met: 0 of 4
9. (drop truck-1 city-3-loc-3 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-3-loc-3) (capacity truck-1 capacity-2)
   goals met: 1 of 4
10. (drive truck-1 city-3-loc-3 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-3)
   added: (at truck-1 city-3-loc-1)
   goals met: 1 of 4
11. (drive truck-1 city-3-loc-1 city-1-loc-1)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-1-loc-1)
   goals met: 1 of 4
12. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 1 of 4
13. (drive truck-1 city-1-loc-3 city-1-loc-7)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-7)
   goals met: 1 of 4
14. (drive truck-1 city-1-loc-7 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-7)
   added: (at truck-1 city-1-loc-2)
   goals met: 1 of 4
15. (drop truck-1 city-1-loc-2 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-1-loc-2) (capacity truck-1 capacity-3)
   goals met: 2 of 4
16. (drive truck-1 city-1-loc-2 city-1-loc-7)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-7)
   goals met: 2 of 4
17. (pick-up truck-1 city-1-loc-7 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-7) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 2 of 4
18. (drive truck-1 city-1-loc-7 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-7)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 4
19. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 2 of 4
20. (drop truck-1 city-1-loc-1 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-1-loc-1) (capacity truck-1 capacity-3)
   goals met: 3 of 4
21. (drop truck-1 city-1-loc-1 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-1-loc-1) (capacity truck-1 capacity-4)
   goals met: 4 of 4
